import random

def відгадай_число():
    загадане_число = random.randint(1, 100)
    спроба = 0

    print("Привіт! Я загадав число від 1 до 100. Спробуй відгадати.")

    while True:
        введене_спроба = int(input("Твоя спроба: "))
        спроба += 1

        if  введене_спроба< загадане_число:
            print("Ваше число занадто мале. Спробуй еще разок.")
        elif введене_спроба > загадане_число:
            print("Ваше число занадто велике. Спробуй еще разок.")
        else:
            print(f"Вітаю! Ти відгадав число {загадане_число} за {спроба} спроб.")
            break

if __name__ == "__main__":
    відгадай_число()